{"id":10,"date":"2024-01-17T10:54:44","date_gmt":"2024-01-17T10:54:44","guid":{"rendered":"https:\/\/dev.neo.uk.com\/?p=10"},"modified":"2024-01-17T10:54:45","modified_gmt":"2024-01-17T10:54:45","slug":"cutting-in-bpl-to-hit-sixes","status":"publish","type":"post","link":"https:\/\/dev.neo.uk.com\/cutting-in-bpl-to-hit-sixes\/","title":{"rendered":"Cutting in BPL to hit sixes"},"content":{"rendered":"\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/images.prothomalo.com\/prothomalo-bangla%2F2024-01%2Fb1161c1f-af12-4e39-9b73-dd561bb60047%2Fjpg__6_.jpg?rect=0%2C0%2C1073%2C604&amp;auto=format%2Ccompress&amp;fmt=webp&amp;format=webp&amp;w=640&amp;dpr=1.3\" alt=\"Cutting will play BPL for the first time\"\/><\/figure>\n\n\n\n<p>Cutting to play BPL for the first time<em>Instagram\/Ben Cutting<\/em><\/p>\n\n\n\n<p>146.96—The number is Ben Cutting&#8217;s strike rate in 209 matches in all forms of T20 cricket. This Australian cricketer of explosive batting will be seen in this year&#8217;s BPL. The 36-year-old pace bowling all-rounder will play for Sylhet Strikers from the beginning of the tournament.<\/p>\n\n\n\n<p>Cutting, who is playing BPL for the first time, has promised his instinctive attacking batting on the soil of Bangladesh. Cutting team Sylhet had its first practice today at Mirpur Sherebangla Stadium. In the pre-practice press conference there, Cutting promised to give the visitors explosive batting, &#8220;Hopefully, you will see some sixes.&#8221; I am waiting to hit the field with bat and ball. Hopefully, I can play some good matches.Read moreStar fair in Rangpur with Shakib-Babar<\/p>\n\n\n\n<p>Cutting can become the main hope of the Sylhet team in this year&#8217;s BPL. Apart from scoring quick runs in the lower order, he also has the ability to play an important role in bowling. The long-bodied pacer&#8217;s extra bounce can come in handy in Sylhet&#8217;s home ground conditions.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/images.prothomalo.com\/prothomalo-bangla%2F2024-01%2Ff4e77556-9a85-48e0-9f9d-7b39634dcd31%2FIMG_20240117_134759_607.jpg?auto=format%2Ccompress&amp;fmt=webp&amp;format=webp&amp;w=640&amp;dpr=1.3\" alt=\"আজ মিরপুরে সাংবাদিকদের সঙ্গে কথা বলেছেন কাটিং\"\/><\/figure>\n\n\n\n<p>Cutting spoke to journalists in Mirpur todayProthom-alo<\/p>\n\n\n\n<p>Cutting is also looking at it. Sylhet will play 5 of the 12 matches in the league phase of the BPL at the Sylhet International Stadium. Cutting considers those 5 matches as important to get a place in the play-offs, &#8216;It is difficult to talk about the results before playing a match. Today is our first practice with the whole team. This is exciting for us. Looking forward to the first match. I have heard a lot about this wicket. It is difficult to play on this wicket. After playing two matches here, we will go to Sylhet. We will play in front of our home crowd. You&#8217;ll want to win five out of five matches there, which will smoothen the rest of our tournament.&#8221;Read moreOpener Smith&#8217;s first innings ends at 12 runs<\/p>\n\n\n\n<p>Cutting says that Sylhet&#8217;s team with Mashrafe-Nazmul is very balanced, &#8220;I think our team is very balanced.&#8221; Met most of the cricketers for the first time today. Played against a few of them over the years. Now the experience of playing in the same team will be good. In my opinion, we have a very strong and balanced team. There is a great combination of domestic and foreign cricketers. This is what is demanded in these tournaments.<\/p>\n\n\n\n<p>Before coming to Bangladesh, he also brought a basic idea about the condition, &#8216;(Whatever the wicket is) I have no problem (laughs). I do both batting and bowling. So wicket batting or bowling – helpful – I don&#8217;t have a problem. To be honest I haven&#8217;t heard much about this wicket. But I have watched BPL on TV for many years, I have seen many runs. As the tournament progressed, I saw the spinners taking control most of the time. It is expected in these tournaments.Read moreLion or oblivion, which way Shamar Joseph&#8217;s career will go with the first ball wicket<\/p>\n\n\n\n<p>Cutting is the only Australian cricketer in this year&#8217;s BPL. Earlier, David Warner, Steve Smith, Brad Hodge, Sean Tait have played in BPL. But there was never an Australian dominance in the BPL. There is a logical reason for that. Cutting reminded that, &#8216;At the same time the Big Bash was held in Australia. Except me, very few Australian cricketers can play in other leagues. Probably only 2-1 freelance cricketers can play. The other one is Chris Lynn, he is playing Big Bash. That is the only reason. But I am sure, boys would have enjoyed a lot when they came to play BPL. Many of the Australians could have played if the schedule had not conflicted with the Big Bash.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Cutting to play BPL for the first timeInstagram\/Ben Cutting 146.96—The number is Ben Cutting&#8217;s strike rate in 209 matches in all forms of T20 cricket. This Australian cricketer of explosive batting will be seen in this year&#8217;s BPL. The 36-year-old pace bowling all-rounder will play for Sylhet Strikers from the beginning of the tournament. Cutting, &#8230; <a title=\"Cutting in BPL to hit sixes\" class=\"read-more\" href=\"https:\/\/dev.neo.uk.com\/cutting-in-bpl-to-hit-sixes\/\" aria-label=\"More on Cutting in BPL to hit sixes\">Read more<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/dev.neo.uk.com\/wp-json\/wp\/v2\/posts\/10"}],"collection":[{"href":"https:\/\/dev.neo.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/dev.neo.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/dev.neo.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/dev.neo.uk.com\/wp-json\/wp\/v2\/comments?post=10"}],"version-history":[{"count":1,"href":"https:\/\/dev.neo.uk.com\/wp-json\/wp\/v2\/posts\/10\/revisions"}],"predecessor-version":[{"id":15,"href":"https:\/\/dev.neo.uk.com\/wp-json\/wp\/v2\/posts\/10\/revisions\/15"}],"wp:attachment":[{"href":"https:\/\/dev.neo.uk.com\/wp-json\/wp\/v2\/media?parent=10"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/dev.neo.uk.com\/wp-json\/wp\/v2\/categories?post=10"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/dev.neo.uk.com\/wp-json\/wp\/v2\/tags?post=10"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}